package chapter3;

// Вычислить площадь круга.
class Area {
    public static void main(String[] args) {
        double pi, r, a;

        r = 10.8;    // радиус круга
        pi = 3.1416;   // приближенное значение pi
        a = pi * r * r;  // вычислить площадь

        System.out.println("Площадь круга равна " + a);
    }
}